<?php
	header("Content-type","text/html;charset=utf-8");
	//1、获取数据
	$pageindex = $_GET['pageIndex'];
	if($pageindex==1){
		echo "第四章 为什么亚历山大大帝所征服的大流士王国在亚历山大死后没有背叛其后继者<br/>
有些人在考虑保有一个新获得的国家而存在的困难时，可能会感到奇怪：为什么亚历山大大帝在几年间变成了亚洲的主宰，而且在他还没有完全征服亚洲的时候就死了，这样一来，全国发生叛乱似乎是理所当然的了，可是亚历山大的后继者们却继续保住江山，而且除了由于他们自己的野心在他们当中出现困难之外，他们并没有遭遇到其他困难。对此，我回答说：有史以来的君主国都是用两种不同的方法统治的：一种是由一位君主以及一群臣仆统治——后者是承蒙君主的恩宠和钦许，作为大臣辅助君主统治王国；另一种是由君主和诸侯统治——后者拥有那种地位并不是由于君主的恩宠而是由于古老的世系得来的。这种诸侯拥有他们自己的国家和自己的臣民。这些臣民把诸侯奉为主子，而且对他们有着自然的爱戴。至于那些由一位君主及其臣仆统治的国家，对他们的君主就更加尊敬了，因为人们认为在全国只有他是至尊无上的。如果他们服从其他任何人，他们只是把此人看作是代理人和官员，对他并不特别爱戴。<br/>
在我们的时代里，关于这两种不同政体的例子就是土耳其皇帝和法兰西国王。土耳其皇帝的君主国是由一位主子统治的，其余的人都是他的臣仆。土耳其皇帝把他的王国划分为若干“州”，他派遣各种行政官员到那里去，并且可以随心所欲地调动或者撤换他们。但是法兰西国王却处在古来就有的一大群贵族当中，这些贵族又为他们的臣民所公认和爱戴，这些贵族又都拥有各自的特权。国王除非自己冒险行事，否则是不能够剥夺这些特权的。因此，一个人如果考察这两个国家，就会认识到要占领土耳其皇帝的国家是困难的，但是如果一旦予以征服，保有这个国家却是很容易的。反之，事实证明：从某些方面来说，占领法兰西这个国家是比较容易的，而要保有它却是困难的。<br/>
占领土耳其皇帝的王国之所以困难，其原因在于入侵者不可能由王国的王侯们召唤进来，也不能够指望倚靠皇帝周围的人们叛变使其谋划获得便利。这是基于上述的理由，因为他们全是君主的奴隶和奴才，要收买他们是很困难的；而且即使把他们收买了，也不能够指望从他们那里得到多大好处，因为他们不能够牵着人民跟随他们，其理由已如上述。因此．向";
	}else if($pageindex==2){
		echo "土耳其进攻的人必须想到：他将会遇到一个团结一致的国家，他必须依靠自己的力量而不是依靠别人的叛乱。但是如果一旦征服了土耳其皇帝，并且把他打得一败涂地以致不能够重振旗鼓，那么除了君主的家族之外便没有什么可怕的人了。而君主的家族被灭绝之后，由于其他的人们原来都没有得到人民的信赖，因此再没有什么可怕的人了；而且因为征服者在自己取得胜利之前并不曾依靠他们，从而其后也不需要害怕他们。<br/>
……<br/>";
	}
?>