<?php
	header("Content-type","text/html;charset=utf-8");
	//1、获取数据
	$pageindex = $_GET['pageIndex'];
	if($pageindex==1){
		echo "尼科洛·马基雅维里上洛伦佐·梅迪奇殿下书<br/>n第一章 君主国有多少种类？是用什么方法获得的？<br/>n第二章 世袭君主国<br/>n第三章 混合君主国<br/>n第四章 为什么亚历山大大帝所征服的大流士王国在亚历山大死后没有背叛其后继者<br/>n第五章 对于占领前在各自的法律下生活的城市或君主国应当怎样统治<br/>n第六章 论依靠自己的武力和能力获得的新君主国<br/>n第七章 论依靠他人的武力或者由于幸运而取得的新君主国<br/>n第八章 论以邪恶之道获得君权的人们<br/>n第九章 论市民的君主国<br/>n第十章 应该怎样衡量一切君主国的力量<br/>n第十一章 论教会的君主国<br/>n第十二章 论军队的种类与雇佣军<br/>";
	}else if($pageindex==2){
		echo "n第十三章 论援军、混合军和本国的军队<br/>n第十四章 君主关于军事方面的责任<br/>n第十五章 论世人特别是君主受到赞扬或者受到责难的原因<br/>n第十六章 论慷慨与吝啬<br/>n第十七章 论残酷与仁慈，被人爱戴是否比被人畏惧来得好些<br/>n第十八章 论君主应当怎样守信<br/>n第十九章 论应该避免受到蔑视与憎恨<br/>n第二十章 堡垒以及君主们每日做的其他许多事情是有益的还是无益的<br/>n第二十一章 君主为了受人尊敬应当怎样为人<br/>n第二十二章 论君主的大臣<br/>n第二十三章 应该怎样避开谄媚者<br/>n第二十四章 意大利的君主们为什么丧失了他们的国家<br/>n第二十五章 命运在人世事务上有多大力量和怎样对抗<br/>n第二十六章 奉劝将意大利从蛮族手中解放出来<br/>n本译本使用和参考的主要书目<br/>n译后记<br/>";
	}
?>